// HTTP-запити
// У React немає вбудованого інструмента для HTTP-запитів. Тому використовуємо сторонні бібліотеки, найпопулярніша з них – Axios.



// npm install axios



// Створимо додаток, в якому є:

// форма пошуку статей;
// HTTP-запит на API Hacker News;
// виведення результатів на сторінку;
// обробка станів завантаження та помилки.


// 
// Форма пошуку



// HTTP-запити можна виконувати за подією,
//  наприклад, при кліку на елементі чи відправці форми.
//  Компонент форми просто збирає значення з поля 
// і передає їх наверх у пропсі onSubmit.


interface SearchFormProps {
    onSubmit: (topic: string) => void;

}

export default function SearchForm({onSubmit}: SearchFormProps) {
    const handleSubmit = ( formData: FormData) => {
        const topic = formData.get("topic") as string;
         // Якщо текстове поле порожнє, виводимо повідомлення 
		// і припиняємо виконання функції.
        if(topic === "") {
            alert("Please enter search topic!");
            return;
        }
        // У протилежному випадку викликаємо пропс 
		// і передаємо йому значення поля

        onSubmit(topic);

    };
    return (
        <form action={handleSubmit}>
            <input type="text" name="topic" />
            <button type="submit">Search</button>
            </form>
    )
}


// Обробка запиту



// Запити виконуються не в компоненті форми, а в App, 
// куди вона передає значення. Це дозволяє розділити відповідальність:
//  форма – за інтерфейс, App – за логіку.



// Обробка даних запиту



// Щоб відобразити результат HTTP-запиту, 
// його обов’язково потрібно зберегти в стані компонента.
//  Інакше React не буде знати, що потрібно оновити інтерфейс.



// Ми будемо зберігати масив статей, 
// тому використовуємо хук useState<Article[]>.
//  Початкове значення – порожній масив.

// 
// React повторно рендерить компонент, коли змінюється стан.
// Якщо не зберегти у useState, інтерфейс не оновиться, навіть якщо запит успішний.


// 🧠 Завжди, коли хочете показати на екрані дані від бекенда, вам потрібно:
// 1. Отримати ці дані (наприклад, з API).
// 2. Зберегти їх у стані (useState)
// 3. Рендерити JSX на основі цього стану




// Відображення даних



// Після того як ми зберегли дані запиту у стані, 
// компонент автоматично оновиться,
//  і ми можемо використати ці дані для рендеру JSX.
//  Використаємо умовне відображення, щоб показувати список лише тоді,
//  коли масив articles не порожній:


// 
// Ми застосували типову схему роботи з HTTP-запитами у React:

// Запустили запит за подією (сабміт форми).
// Типізували відповідь від бекенду (ArticlesHttpResponse).
// Зберегли отримані дані у стан (useState).
// Вивели JSX-розмітку на основі цього стану.


// 💡 Цей патерн – універсальний: він застосовується майже 
// в усіх React-додатках, які взаємодіють з бекендом.




// Структура файлів



// Щоб зробити код більш зрозумілим і масштабованим, 
// ми винесемо частину логіки в окремі файли:

// Оскільки список статей – це окрема частина інтерфейсу, 
// винесемо його у компонент ArticleList.tsx.
//  Компонент отримає масив статей через проп items і відобразить їх.
// Створимо файл src/types/article.ts, 
// щоб не дублювати тип Article у різних місцях.
// У App залишиться логіка запиту, стан і умовний рендер ArticleList.

//  Рендеринг за умовою ({articles.length > 0 && ...}) відбувається у
//  компоненті App. Сам компонент ArticleList завжди показує список,
//  якщо його рендерять. Тобто логіка "показати чи ні" –
//  це відповідальність App, а не ArticleList.




// Індикатор завантаження



// Поки виконується HTTP-запит, у користувача на екрані – порожнє місце,
//  що виглядає як помилка або зависання.
//  Щоб цього уникнути, показують індикатор завантаження.



// Індикатор – це реактивне значення,
//  тобто його потрібно зберігати в стані компонента. 
// Зазвичай це булевий прапорець:

// true – запит виконується
// false – запиту немає або він уже завершився



// Індикатор завантаження може бути будь-чим:
//  простим текстом, іконкою тощо. Одна з популярних бібліотек –
//  React Loader Spinner, яка надає десятки готових компонентів із різним дизайном.



// 🧠 Завжди показуйте користувачеві, що дані завантажуються,
//  навіть якщо це триває менше секунди – це покращує UX.




// Обробка помилок



// HTTP-запити можуть завершуватися неуспішно – наприклад,
//  через відсутність інтернету або помилку на сервері. 
// Тому завжди потрібно відображати повідомлення про помилку,
//  щоб користувач розумів, що сталося.



// Для цього:

// Додаємо стан isError для відстеження помилки.
// Обгортаємо запит у try...catch, щоб перехопити можливу помилку.
// Виводимо повідомлення, якщо значення isError це true.